import os
import asyncio
from dotenv import load_dotenv


load_dotenv()
TOKEN = os.getenv("TOKEN")

from telegram import Update, ReplyKeyboardMarkup
from telegram.ext import (
    ApplicationBuilder,
    CommandHandler,
    MessageHandler,
    ContextTypes,
    filters
)

խաղեր = {
    "Minecraft": {
        "գին": "5000 դրամ կամ անվճար տարբերակ",
        "ինֆորմացիա": "Այստեղ խաղացողը չունի ոչինչ և ինքնուրույն պետք է հայթայթի ու գտնի բոլոր բնական ռեսուրսները (փայտ, քար, երկաթ, ածուխ և այլն)։ Այս բոլորը խաղացողին պետք են գալու հետագայում խաղի մեջ։ Կախված խաղի բարդությունից` խաղի գիշերային ժամերին և այն տարածքներում որտեղ ամբողջովին խավար է, հայտնվելու են տարբեր տիպի հրեշներ՝ զոմբիներ, սարդեր, կմախքներ նետ ու աղեղով և այլն։ Այս ռեժիմում կա նաև կյանքի սանդղակ, որը կարող է իջնել, երբ քո վրա հարձակվում են հրեշները, կամ դու ընկնում ես ջրի մեջ և երկար ես մնում այնտեղ (այդ դեպքում դու խեղդվում ես), կամ էլ ընկնում ես լավայի մեջ։ Ինչպես նաև համակարգչային տարբերակում խաղացողն ունի ուտելիքի սանդղակ, որը քիչ-քիչ ընկնում է, և խաղացողը պետք է երբեմն ինչ-որ բան ուտի։ Կյանքերը վերականգնվում են, երբ խաղացողը լիարժեք սնված է, կամ էլ այն կարող է ինքնուրույն վերականգնվել, եթե դու խաղում ես «Խաղաղ» բարդության ժամանակ։"
    },
    "CS GO": {
        "գին": "Անվճար է",
        "ինֆորմացիա": "Ինչպես շարքի նախորդ խաղերը, Counter-Strike: Global Offensive-ը 3D բազմակառավարելի առաջին դեմքի հրաձիգ է, որտեղ խաղացողները բաժանվում են երկու թիմի և պայքարում միմյանց դեմ։ Խաղը ներառում է երկու թիմ՝ ահաբեկիչներ և հատուկ ջոկատայիններ, ինչպես նաև պարունակում է մի քանի բազմակառավարելի խաղի ռեժիմներ՝ նորմալ և մրցակցային ռեժիմ (ականազերծում, պատանդների փրկություն), բեթլ ռոյալ, պատերազմական խաղեր (սպառազինությունների մրցավազք, օբյեկտների ոչնչացում, միգրացիոն դիպուկահարներ), պայքար մինչև մահ, մաքրում, համատեղ արշավանք, գործընկերներ և պահակ։ Առաջին սցենարում, որպես ահաբեկչական թիմի խաղացողներ, նրանք պետք է ռումբ տեղադրեն նշված մի քանի կետերից մեկում, իսկ հատուկ ջոկատայինները պետք է հաջողությամբ ականազերծեն այն։ Երկրորդ սցենարում ահաբեկչական թիմի խաղացողները պետք է թույլ չտան հակառակորդ թիմին փրկել իրենց առևանգած պատանդներին[6]։"
    },
    "GTA V": {
        "գին": "8000 դրամ",
        "ինֆորմացիա": "2004 թվական, Լյուդենդորֆ, Հյուսիսային Յանկտոն։ Պրոֆեսիոնալ ավազակներ և լավագույն ընկերներ Մայքլ Թաունլին, Թրևոր Ֆիլիպսը և Բրեդ Սնայդերը զինված հարձակում են գործում տեղական բանկի վրա։ Կողոպուտը հաջողվում է, սակայն հեռանալիս մեքենան վթարի է ենթարկվում, և հերոսները ստիպված են լինում փախչել ոտքով։ Բրեդն ու Մայքլը հրազենային վիրավորում են ստանում Դաշնային hետաքննությունների բյուրոյի (Հետաքննությունների դաշնային բյուրոյի խաղային ադապտացիան) գործակալ Դեյվ Նորթոնի կողմից։ Թրևորին հաջողվում է փախչել։Ավելի ուշ պարզվում է, որ հրաձգության ժամանակ վիրավորված Մայքլը, ազատազրկումից խուսափելու համար, գաղտնի համաձայնության է գալիս գործակալ Նորթոնի հետ, բեմադրում սեփական մահը և վկաների պաշտպանության ծրագրի շրջանակում ընտանյոք հանդերձ տեղափոխվում Լոս Սանտոս և սկսում հանդես գալ Դե Սանտա ազգանվամբ։Անփառունակ կողոպուտից անցնում է 9 տարի։ Մայքլն անընդատ լարված հարաբերությունների մեջ է ընտանիքի անդամների հետ։ Նա հաճախում է հոգեբան Այզեա Ֆրիդլանդերի անհատական խորհրդատվություններին, ով, նրա կարծիքով, ամենևին էլ չի օգնում։ Գանգստեր Ֆրենկլին Քլինթոնը, ով իր ընկեր Լամար Դեյվիսի հետ աշխատում էր ամերիկահայ խարդախ մեքենավաճառ Սիմեոն Եթարյանի մոտ, պատահաբար առերեսվում է Մայքլին, երբ փորձում էր խաբեությամբ գողանալ իր որդու՝ սրահից ձեռք բերված մեքենան։ Հետագայում Մայքլն ու Ֆրենկլինը մտերմանում են։ Երբ մի անգամ Մայքլը տուն վերադառնալիս ննջասենյակում կնոջը բռնացնում է թենիսի մարզչի հետ, նա Ֆրենկլինի հետ հետապնդում է մարզչին, ի վերջո գետնին հավասերեցնելով նրա առանձնատունը։ Առանձնատան սեփականատերը՝ նարկոբարոն Մարտին Մադրազոն, փոխհատուցում է պահանջումԳումարը հայթայթելու համար Մայքլը ստիպված է լինում վերադառնալ իր հանցավոր անցյալին, որպես հանցակից ներգրավելով նաև Ֆրենկլինին։ Մայքլի հին ընկեր հաշմանդամ հաքեր Լեստեր Քրեստի օգնությամբ նրանք թալանում են ոսկերչական խանութը, ինչից ստացված գողոնը բավարար է լինում պարտքը մարելու համար։ Միևնույն ժամանակ, Թրևորը, ով հակահիգենիկ պայմաններում ապրում է Բլեյն շրջանի փոքր բնակավայրերից մեկում, նորություններից տեղեկանում է խանութի կողոպուտի մասին և, նշմարելով վաղեմի ընկերոջ ձեռագիրը, սկսում կասկածել երբեմնի Մայքլ Թաունլիի սպանության ճշմարտացիության շուրջ։ Ի վերջո, Թրևորին հաջողվում է հայտնաբերել Մայքլին և վերամիավորվել նրա հետ, թեև վերջինս դրան պատրաստ չէր։Ժամանակի ընթացքում Մայքլի, Թրևորի և Ֆրենկլինի վարած կյանքը դուրս է գալիս վերահսկողությունից։ Հանցավոր կյանք վերադառնալու պատճառով ընտանիքը լքում է Մայքլին։ Երբ նա հետագայում դառնում է կինոպրոդյուսեր, նա կոնֆլիկտի մեջ է մտնում միլիարդատեր և ագրեսիվ վենչուրային կապիտալիստ Դևին Ուեսթոնի հետ, ով փորձում է փակել Մայքլի ստուդիան։ Մայքլը կարողանում է խափանել Ուեսթոնի ծրագրերը, սակայն միևնույն ժամանակ պատասխանատու է դառնում Ուեսթոնի օգնականի անզգույշ մահվան մեջ՝ ստիպելով Դևինին վրեժխնդիր լինել։ Միևնույն ժամանակ, Ֆրենկլինը պետք է փրկի իր ընկեր Լամար Դեյվիսին իր նախկին ընկերոջ և մրցակից գանգստեր Հարոլդ «Սթրեթչ» Ջոզեֆից, ով փորձում էր սպանել նրանց, որպեսզի կարողանա միանալ Բալաների հանցախմբին։ Միևնույն ժամանակ, Թրևորը փորձում է ամրապնդել իր դիրքերը Բլեյն շրջանի տարբեր սև շուկաների վրա՝ մի քանի ճակատով պատերազմ մղելով «Կորուսյալներ» բայքերական ակումբի, լատինաամերիկյան փողոցային ավազակախմբերի, մրցակից մեթամֆետամինադիլերների, «Մերիվեդեր» մասնավոր անվտանգության ընկերության և չինական տրիադների պարագլուխ Վեյ Չենգի դեմ։Կրկին կողոպուտի մասնակցելով Մայքլը խախտել էր գործակալ Դեյվ Նորթոնի հետ իր համաձայնությունը, ուստի Դեյվը և վերջինիս վերադաս Սթիվ Հեյնսը ստիպում են Մայքլին, Ֆրենկլինին և Թրևորին մի շարք գախտնի օպերացիաներ կատարել Միջազգային հարաբերությունների գործակալության (Կենտրոնական հետախուզական վարչության խաղային ադապտացիան) համար։ Սթիվի ղեկավարությամբ և Լեստերի հսկողությամբ եռյակը հարձակվում է գործակալության դրամական միջոցները տեղափոխող ավտոշարասյան վրա և կողոպտում փորձարարական քիմիական զենք գործակալության լաբորատորիայից։ Քանի որ Սթիվը սկսում է հայտնվել անվտանգության ծառայությունների հետաքրքրության շրջանակում, նա ստիպում է Մայքլին և Ֆրենկլինին ջնջել իր դեմ ապացույցները Դաշնային hետաքննությունների բյուրոյի սերվերներից։ Առիթից օգտվելով, Մայքլը կարողանում է ջնջել նաև իր տվյալները բազայից, այդ կերպ մեկընդմիշտ զրոյացնելով Սթիվի լծակները նրա հանդեպ։Ընտանիքի հետ հաշտվելուց հետո Մայքլը Թրևորի, Ֆրենկլինի և Լեստերի հետ սկսում է պլանավորել իր վերջին կողոպուտը։ Դարակազմիկ կողոպուտի առարկան այս անգամ պետք է լիներ դաշնային գանձատան ոսկու ձուլակտորների պահուստը։ Այնուամենայնիվ, Թրևորը հայտնաբերում է, որ Լյուդենդորֆի կողոպուտից ի վեր Բրեդը ոչ թե բանտարված է, ինչպես նա գիտեր, այլ սպանված և թաղված Մայքլի համար նշված գերեզմանում։ Ենաթադրելով, որ Բրեդի փոխարեն իրեն պետք է սպանեին, Թրևորն իրեն դավաճանված է զգում։ Գերեզմանոցում Մայքլի հետ առերեսվելիս, Թրևորը նկատում է նրանց մոտեցող Չենգի բանդայի անդամներին և Մայքլին մենակ թողնում նրանց հետ հրաձգության ժամանակ։ Միևնույն ժամանակ, Սթիվը դավաճանում է Մայքլին ու Դեյվին, ինչի պատճառով նրանց հանդիպման վայրում են հայտնվում ԴՀԲ-ի, ՄՀԳ-ի և նույնիսկ՝ «Մերիվեդեր» մասնավոր անվտանգության ուժայինները։ Սկսվում է լարված հրաձգություն։ Թրևորն օգնում է Մայքլին և Դեյվին, պնդելով, որ միայն նա բարոյական իրավունք ուներ սպանել Մայքլին՝ համաձայնելով վերջինիս հետ կատարել դաշնային գանձատան կողոպուտը և դրանից հետո բաժանվել։Կողոպուտը պսակվում է հաջողությամբ, սակայն շատ չանցած Ֆրենկլինին են մոտենում Սթիվը և Դեյվը, ովքեր պնդում են, որ Թրևորն անկայուն մարդ է և պետք է ոչնչացվի։ Ավելի ուշ Ֆրենկլինին է այցելում Դևին Ուեսթոնը, ով իր հերթին պնդում է, որ պետք է Մայքլը սպանվի։ Ֆրանկլինն ունի երեք ընտրություն՝ սպանել Թրևորին, սպանել Մայքլին կամ ռիսկի դիմել և փորձել փրկել երկուսին էլ։ Մայքլին կամ Թրևորին սպանելու դեպքում, Ֆրենկլինը դադարեցնում է կապն այն մարդու հետ, ում կյանքը խնայում է և վերադառնում է իր հին կյանքին։ Երրորդ տարբերակի դեպքում, Մայքլն ու Թրևորը հաշտվում են, և եռյակը, Լամարի և Լեստերի աջակցությամբ, դիմակայում են ԴՀԲ-ի և «Մերիվեդերի» հարձակմանը, նախքան Չենգին, Սթրեթչին, Սթիվին և Դևինին ոչնչացնելը։ Երեք հերոսները դադարում են միասին աշխատել, սակայն մնում են ընկերներ։"
    },
    "It Takes Two": {
        "գին": "12000 դրամ",
        "ինֆորմացիա": "«It Takes Two»-ը մարտա-արկածային տեսախաղ է՝ պլատֆորմերի տարրերով: Մշակված լինելով հատուկ բաժանված էկրանով համագործակցային խաղի համար, այն պահանջում է երկրորդ խաղացող, որը կարող է նաև միանալ առցանց: Խաղացողները վերահսկում են փոքրիկ աղջկա՝ Ռոուզի ծնողներին, որոնք ամուսնալուծության եզրին են: Սիրո մասին կախարդական գիրքը կերպարներին վերածում է փոքրիկ տիկնիկների, և այժմ, իրենց նախկին կերպարը վերականգնելու համար, նրանք պետք է հաղթահարեն իրենց դժգոհություններն ու տարաձայնությունները և աշխատեն միասին:[2] Խաղն առաջարկում է տարբեր ժանրերի խաղային մեխանիկաների բազմազանություն:[3]"
    },
    "PUBG Battlegrounds": {
        "գին": "Անվճար է",
        "ինֆորմացիա": "PUBG: Battlegrounds (նախկինում կոչվում էր PlayerUnknown's Battlegrounds) 2017 թվականի battle royale տեսախաղ է, որը հրատարակվել է Krafton-ի կողմից և մշակվել Krafton-ի PUBG Studios-ի կողմից: Խաղը, որը ոգեշնչված է ճապոնական Battle Royale (2000) ֆիլմից, հիմնված է Բրենդան «PlayerUnknown» Գրինի կողմից այլ խաղերի համար ստեղծված նախորդ մոդերի վրա և ընդլայնվել է որպես ինքնուրույն խաղ՝ Գրինի ստեղծագործական ղեկավարությամբ: Խաղացվում է երրորդ կամ առաջին դեմքի տեսանկյունից, մինչև հարյուր խաղացողներ պարաշյուտով իջնում ​​են կղզու վրա, որտեղ նրանց հանձնարարվում է զենք և սարքավորումներ փնտրել՝ մյուս խաղացողներին սպանելու համար՝ խուսափելով ինքնասպանությունից: Խաղի քարտեզի հասանելի անվտանգ տարածքը ժամանակի ընթացքում փոքրանում է՝ կենդանի մնացած խաղացողներին ուղղորդելով անընդհատ նեղացող տարածք՝ բախումներ պարտադրելու համար:PlayerUnknown's Battlegrounds-ը առաջին անգամ թողարկվել է Windows-ի համար Steam-ի վաղ մուտքի բետա ծրագրի միջոցով 2017 թվականի մարտին, իսկ լիարժեք թողարկումը՝ 2017 թվականի դեկտեմբերին: Նույն ամսին Microsoft Studios ստուդիաները այն թողարկեցին Xbox One-ի համար՝ Xbox Game Preview ծրագրի միջոցով, իսկ ամբողջական թողարկումը տեղի ունեցավ 2018 թվականի սեպտեմբերին։ Այնուհետև խաղը տեղափոխվեց PlayStation 4, Xbox Series X/S և PlayStation 5 խաղային համակարգերի, ինչպես նաև Stadia հոսքային հարթակի վրա, ինչպես նաև թողարկվեց Android-ի և iOS-ի համար նախատեսված PUBG Mobile բջջային տարբերակը։ Խաղը անընդհատ մշակվում է խաղերի շրջանակներում՝ որպես ծառայողական մոդել, և 2022 թվականի հունվարից ի վեր անվճար է բոլոր հարթակների համար։"
    },

    "Brawl Stars": {
        "գին": "Անվճար է",
        "ինֆորմացիա": "Խաղը կենտրոնացված է նրանում, որ խաղացողը 3 հոգուց կազմված թիմով հաղթի այլ թիմերին կամ ԱԲ ղեկավարության տակ գտնվող հակառակորդին՝ տարատեսակ խաղային ռեժիմների մեջ։ Խաղացողը կարող է ընտրել կերպարներ (ներկայացված են 80), որոնցից յուրաքանչյուրը ունեն իրենց ունակությունը և գերհատկությունը։ Ինչպես նաև յուրաքանչյուր կերպար ունի իր պասիվ ունակությունը, որը կարելի է գնել 2000 մետաղադրամներով կամ ստանալ Լեգենդար Ստարր Դրոպներից:Խաղացողները պետք է ընտրեն պայքարելու համար ռեժիմ, օրինակ՝ «Գրավման պարգևատրում» ռեժիմը, որտեղ 2 թիմն էլ փորձում են հավաքել ինչքան հնարավոր է շատ աստղեր՝ ոչնչացնելով մրցակցին։ «Կողոպուտ» ռեժիմում թիմերը պետք է ոչնչացնել միմյանց պահոցները՝ պահպանելով իրենցը։ Իսկ «Բյուրեղի գրավում» ռեժիմում հաղթում է այն թիմը, որը հավաքել է ավելի շատ բյուրեղներ, քան մյուսը։ «Բախում» ռեժիմը (մենակ կամ 2-ով) նման է համակարգչային թագավորական պայքար խաղին, 10 մասնակից պետք է մրցեն միմյանց հետ քարտեզի վրա, որի սահմանները ժամանակի հետ փոքրանում են թունավոր ամպի միջոցով[5][6]"   
},
"UFC 5":{
    "գին": "4000",    
    "ինֆորմացիա": "Metacritic-ի գրախոսականների ագրեգատորի տվյալներով՝ խաղը թողարկման պահից քննադատներից ստացել է «ընդհանուր առմամբ դրական արձագանքներ»։[6]IGN-ի Թաններ Սմիթը խիստ գովաբանել է խաղը և անվանել այն «լավագույն MMA խաղը», գովաբանելով դրա ուշադրությունը մանրամասներին, նոր վնասի համակարգը, որը խաղացողներին մղում է վերանայել իրենց ռազմավարությունը մարտի կեսին, և կարիերայի ռեժիմի ավելի խորը կենտրոնացումը պատմության վրա։[7] Game Informer-ի Բրայան Շիան նշել է, որ չնայած խաղի թերություններին (օրինակ՝ UFC կերպարների ցուցակում «ակնառու բացթողումներ» և կարիերայի ռեժիմի կրկնվող բնույթ), այն, այնուամենայնիվ, «ապահովում է հետաքրքիր MMA փորձառություն», և որ «ադրենալինի ալիքը, որը գալիս է հակառակորդին կատաղի մարտում նոկաուտի ենթարկելուց, դժվարացնում է դիմադրել ութանկյուն վերադառնալու գայթակղությանը՝ ևս մեկ մենամարտի համար»։[8]Game Revolution-ի Նիկոլաս Թանը խաղին տվեց ավելի բացասական գնահատական՝ քննադատելով խաղի էական թարմացումների բացակայությունը՝ համեմատած UFC 4-ի հետ, և նշեց, որ խաղացողները, ովքեր վայելում են UFC խաղերի միայնակ խաղացողի բաղադրիչը, կարող են UFC 5-ի կարիերայի ռեժիմը համարել գրեթե նույնական նախորդների հետ։[9]:UFC 5-ը Մեծ Բրիտանիայում թողարկման շաբաթվա ընթացքում ֆիզիկական ձևաչափով թողարկված յոթերորդ ամենաշատ վաճառվող խաղն էր։[10] ԵՄ-ում այն ​​2024 թվականի 12-րդ ամենաշատ ներբեռնված խաղն էր։[11] ԱՄՆ-ում այն ​​հասավ 7-րդ հորիզոնականին։"
}
}
ծրագրեր = {
    "Photoshop": {"գին": "4000 դրամ", "ինֆորմացիա": "նկարների խմբագրում"},
    "VS Code": {"գին": "Անվճար է", "ինֆորմացիա": "code editor"},
    "Telegram": {"գին": "Անվճար է", "ինֆորմացիա": "messenger"},
    "Discord": {"գին": "Անվճար է", "ինֆորմացիա": "messenger"}
}

Դոնատներ = {
    "Bravl Stars": {"ինֆորմացիա":                    
"""⚡️ 33 գեմ - 600 դրամ
⚡️ 88 գեմ - 1400 դրամ
⚡️ 187 գեմ - 2800 դրամ
⚡️ 396 գեմ - 5600 դրամ
⚡️ 1045 գեմ - 13800 դրամ
⚡️ 2200 գեմ - 27600 դրամ

 😍Սենց Էժան Գեմեր դու ոչ մի տեղ չես գտնի, կարող ես գնել IT BOT-ից

Վճարումը կատարվում է Tellcel Wallet տերմինալների շնորհիվ։

Դոնատը գնելուց հետո գրումեք ձեր խաղային Gmail ը։

        Գնելու համար գրիր Admin-ին-> @tyomkurghinyan    

"""},
    "Black Russia": {"ինֆորմացիա": 
"""⚡️ 60 Bc - 500 դրամ
⚡️ 150 Bc - 900 դրամ
⚡️ 300 Bc - 1500 դրամ
⚡️ 500 Bc - 2500 դրամ
⚡️ 750 Bc - 3800 դրամ
⚡️ 1000 Bc - 5500 դրամ
⚡️ 3000 Bc - 13800 դրամ
⚡️ 5000 Bc - 22700 դրամ
⚡️ 7000 Bc - 31600 դրամ
⚡️ 10000 Bc - 45300 դրամ

 😍Black Russia խաղի Դոնաթները նորից վերադարձել են մատչելի գներով, որը կարող ես գնել IT BOT-ից

Վճարումը կատարվում է Tellcel Wallet տերմինալների շնորհիվ։

 Դոնաթը առնելուց հետո կգրեք ձեր խաղաին Նիկը, սերվերը ու պառոլը վերջ

        Գնելու համար գրիր Admin-ին-> @tyomkurghinyan  

"""},
    "PUBG Mobile": {"ինֆորմացիա": """
⚡️ 60 UC - 500 դրամ
⚡️ 325 UC - 2400 դրամ
⚡️ 660 UC - 4900 դրամ
⚡️ 1800 UC - 12500 դրամ
⚡️ 2460 UC - 17600 դրամ
⚡️ 3850 UC - 24900 դրամ
⚡️ 5000 UC - 36900 դրամ
⚡️ 8100 UC - 48900 դրամ
⚡️ 12610 UC - 78900 դրամ
⚡️ 14300 UC - 98900  դրամ
⚡️ 16200 UC -147900 դրամ
⚡️ Elite lvl1-100 - 5500 դրամ
⚡️ Bonus lvl1-100 - 7500 դրամ
⚡️ Elite + lvl1-100 - 13300 դրամ
                    
😍Վերջապես շատերի խնդրանքով մեզ մոտ ավելացավ ամենա էժան ու ապահով PUBG-ի դոնաթները, որը կարող ես գնել  IT BOT-ից
                
       Վճարումը կատարվում է Tellcel Wallet տերմինալների շնորհիվ։

 Դոնաթը առնելուց հետո կգրեք ձեր խաղաին ID-ին և վերջ
                    
        Գնելու համար գրիր Admin-ին-> @tyomkurghinyan               
                        """},
    "ROBLOX": {"ինֆորմացիա":"""
⚡️ 40 Robux - 400 դրամ 
⚡️ 80 Robux - 700 դրամ 
⚡️ 500 Robux - 2400 դրամ 
⚡️ 1000 Robux - 4600 դրամ 
⚡️ 2000 Robux - 9200 դրամ 
⚡️ 5250 Robux - 23000 դրամ 
⚡️ 11000 Robux - 46000 դրամ 
⚡️ 24000 Robux - 92000 դրամ 
               
😍 Մատչելի Roblox-ի Դոնաթները, կարող ես գնել IT BOT-ից
 

Վճարումը կատարվում է Tellcel Wallet տերմինալների շնորհիվ։

Դոնատը գնելուց հետո գրումեք ձեր խաղային Login ը և password ը։
               
        Գնելու համար գրիր Admin-ին-> @tyomkurghinyan               
"""},
"Free Fire": {"ինֆորմացիա": """

⚡️ 110 ալմազ - 400 դրամ
⚡️ 341 ալմազ - 1300 դրամ
⚡️ 572 ալմազ - 2200 դրամ
⚡️ 1166 ալմազ - 4300 դրամ
⚡️ 2398 ալմազ - 8600 դրամ
⚡️ 6160 ալմազ - 20300 դրամ
⚡️ 1 շաբաթ վաուչեր լայթ - 300 դրամ
⚡️ 1 շաբաթ վաուչեր - 900 դրամ
⚡️ 1 ամիս վաուչեր - 3200 դրամ
⚡️ Evo Access 3օր - 300 դրամ
⚡️ Evo Access 7օր - 500 դրամ
⚡️ Evo Access 30օր - 1300 դրամ
⚡️ Պռոպուսկ Պ. 6 LVL - 300 դրամ
⚡️ Պռոպուսկ Պ. 15 LVL - 400 դրամ
⚡️ Պռոպուսկ Պ. 10 LVL - 400 դրամ
⚡️ Պռոպուսկ Պ. 20 LVL - 400 դրամ
⚡️ Պռոպուսկ Պ. 25 LVL - 400 դրամ
⚡️ Պռոպուսկ Պ. 30 LVL - 500 դրամ
              
✔️ Էժանացված FF-ի դոնաթները, Կարող ես մատչելի ու արագ գնել IT BOT-ից

Վճարումը կատարվում է Tellcel Wallet տերմինալների շնորհիվ։

Դոնատը գնելուց հետո գրումեք ձեր խաղային ID-ին և վերջ։
              
        Գնելու համար գրիր Admin-ին-> @tyomkurghinyan
"""}
}

հարցեր = [

    {
        "հարց": "Հայաստանի մայրաքաղաքը որն է",
        "տարբերակներ": ["Երևան", "Գյումրի", "Վանաձոր", "Կապան"],
        "ճիշտ": "Երևան",
        "գումար": "1000 դրամ"
    },
    {
        "հարց": "2-ի քառակուսին",
        "տարբերակներ": ["2", "4", "6", "8"],
        "ճիշտ": "4",
        "գումար": "5000 դրամ"
    },
    {
        "հարց": "512-ի խորանարդը",
        "տարբերակներ": ["27","125","256","8"],
         "ճիշտ": "8",
        "գումար": "10000 դրամ"
    },
     {
        "հարց": "[Որտեղ է գտնվում էֆելյան աշտարակը]",
        "տարբերակներ": ["Ամերիկա","Ֆրանսիա","Գերմանի","Չինաստան"],
         "ճիշտ": "Ֆրանսիա",
        "գումար": "20000 դրամ"
    },
    {
        "հարց": "[Ով ես ստեղծել Tesla ավտոմեքենան]",
        "տարբերակներ": ["Ilon Mask","Հովհանես թումանյան","Մեսրոպ մասշտոց","Տյոմ Կուրղինյան"],
         "ճիշտ": "Ilon Mask",
        "գումար": "50000 դրամ"
    },
     {
        "հարց": "[Ով է ստեղծել հայոց տառերը]",
        "տարբերակներ": ["Մեսրոպ Մաշտոց","Հովհաննես Թումանյան","Զաբել Եսայան","Համո Սահյան"],
         "ճիշտ": "Մեսրոպ Մաշտոց",
        "գումար": "100000 դրամ"
    },
    {
        "հարց": "[Որ թվականին է ստեղծվել հայոց տառերը]",
        "տարբերակներ": ["405","551","303","301"],
         "ճիշտ": "405",
        "գումար": "250000 դրամ"
    },
      {
        "հարց": "[Որտեղ են բնակվել հնադարյան մարդիք]",
        "տարբերակներ": ["տներում","դրսում","քարանձավներում","շենքերում"],
         "ճիշտ": "քարանձավներում",
        "գումար": "500000 դրամ"
     },
     {
        "հարց": "[Ո՞րն է Վահան Տերյանի առաջին տպագիր ժողովածուն:]",
        "տարբերակներ": ["Գիշեր և հուշեր","Մթնշաղի անուրջներ","Ոսկի հեքիաթ"],
         "ճիշտ": "Մթնշաղի անուրջներ",
        "գումար": "750000 դրամ"
    },
    {
        "հարց": "[Րաֆֆու «Սամվել» վեպը ո՞ր ժանրին է պատկանում]",
        "տարբերակներ": ["Պատմական վեպ","Սոցիալական դրամա","Հոգեբանական պատմվածք"],
         "ճիշտ": "Պատմական վեպ",
        "գումար": "1000000 դրամ"
    },

]

load_dotenv()
TOKEN = os.getenv("TELEGRAM_TOKEN")

main_keyboard = ReplyKeyboardMarkup(
    [["Ծրագրեր", "Խաղեր"], ["Դոնատներ", "Միլիոնատեր"]],
    resize_keyboard=True
)

def build_keyboard(options):
    keyboard = []
    row = []

    for option in options:
        row.append(option)
        if len(row) == 2:
            keyboard.append(row)
            row = []

    if row:
        keyboard.append(row)

    return ReplyKeyboardMarkup(keyboard, resize_keyboard=True)


async def start(update: Update, context: ContextTypes.DEFAULT_TYPE):
    context.user_data.clear()
    await update.message.reply_text("Բարև ընտրիր", reply_markup=main_keyboard)


async def handle_message(update: Update, context: ContextTypes.DEFAULT_TYPE):
    text = update.message.text.strip()

    if text == "Խաղեր":

        keyboard = [
            ["Minecraft", "CS GO"],
            ["GTA V", "It Takes Two"],
            ["PUBG Battlegrounds","Brawl Stars","UFC 5"],
            ["Back"]
        ]

        await update.message.reply_text(
            "Ընտրիր խաղ",
            reply_markup=ReplyKeyboardMarkup(keyboard, resize_keyboard=True)
        )

    elif text in խաղեր:
        context.user_data.clear()
        context.user_data["ընտրություն"] = text

        keyboard = [["գին", "ինֆորմացիա"], ["Back"]]

        await update.message.reply_text(
            f"{text}",
            reply_markup=ReplyKeyboardMarkup(keyboard, resize_keyboard=True)
        )

    elif text == "Ծրագրեր":

        keyboard = [
            ["Photoshop", "VS Code"],
            ["Telegram", "Discord"],
            ["Back"]
        ]

        await update.message.reply_text(
            "Ընտրիր ծրագիր",
            reply_markup=ReplyKeyboardMarkup(keyboard, resize_keyboard=True)
        )

    elif text in ծրագրեր:
        context.user_data.clear()
        context.user_data["ընտրություն"] = text

        keyboard = [["գին", "ինֆորմացիա"], ["Back"]]

        await update.message.reply_text(
            f"{text}",
            reply_markup=ReplyKeyboardMarkup(keyboard, resize_keyboard=True)
        )

    elif text == "գին":
        ընտրություն = context.user_data.get("ընտրություն")

        if ընտրություն in խաղեր:
            await update.message.reply_text(խաղեր[ընտրություն]["գին"])
        elif ընտրություն in ծրագրեր:
            await update.message.reply_text(ծրագրեր[ընտրություն]["գին"])
        else:
            await update.message.reply_text("Սկզբից ընտրիր")

    elif text == "ինֆորմացիա":
        ընտրություն = context.user_data.get("ընտրություն")

        if ընտրություն in խաղեր:
            await update.message.reply_text(խաղեր[ընտրություն]["ինֆորմացիա"])
        elif ընտրություն in ծրագրեր:
            await update.message.reply_text(ծրագրեր[ընտրություն]["ինֆորմացիա"])
        else:
            await update.message.reply_text("Սկզբից ընտրիր")

    elif text == "Դոնատներ":

        keyboard = [
            ["Bravl Stars", "Black Russia"],
            ["PUBG Mobile", "ROBLOX"],
            ["Free Fire"],
            ["Back"]
        ]

        await update.message.reply_text(
            "Ընտրիր խաղ",
            reply_markup=ReplyKeyboardMarkup(keyboard, resize_keyboard=True)
        )

    elif text in Դոնատներ:
        await update.message.reply_text(Դոնատներ[text]["ինֆորմացիա"])

    elif text == "Միլիոնատեր":

        context.user_data.clear()
        context.user_data["հարց_index"] = 0

        հարց = հարցեր[0]

        await update.message.reply_text(
            f"{հարց['հարց']}\n\nԳումար {հարց['գումար']}",
            reply_markup=build_keyboard(հարց["տարբերակներ"])
        )

    elif "հարց_index" in context.user_data:

        index = context.user_data["հարց_index"]
        հարց = հարցեր[index]

        if text == հարց["ճիշտ"]:

            index += 1

            if index >= len(հարցեր):

                await update.message.reply_text(
                    f"Շնորհավոր դու հաղթեցիր\nՇահեցիր {հարց['գումար']}",
                    reply_markup=main_keyboard
                )

                context.user_data.clear()

            else:

                context.user_data["հարց_index"] = index
                հաջորդ = հարցեր[index]

                await update.message.reply_text(
                    f"Ճիշտ է\n\n{հաջորդ['հարց']}\n\nԳումար {հաջորդ['գումար']}",
                    reply_markup=build_keyboard(հաջորդ["տարբերակներ"])
                )

        else:

            await update.message.reply_text(
                f"Սխալ\nՃիշտ պատասխանն էր {հարց['ճիշտ']}",
                reply_markup=main_keyboard
            )

            context.user_data.clear()

    elif text == "Back":
        context.user_data.clear()
        await update.message.reply_text("Menu", reply_markup=main_keyboard)

    else:
        await update.message.reply_text("Չհասկացա", reply_markup=main_keyboard)
async def start(update: Update, context: ContextTypes.DEFAULT_TYPE):
    context.user_data.clear()

    msg = await update.message.reply_text("Բեռնում է...")

    await asyncio.sleep(1)
    await msg.edit_text("Մի քիչ սպասիր...")

    await asyncio.sleep(1)
    await msg.edit_text("Պատրաստ է!")

    await asyncio.sleep(0.5)

    await update.message.reply_text(
        "Բարև ընտրիր",
        reply_markup=main_keyboard
    )

app = ApplicationBuilder().token(TOKEN).build()
app.add_handler(CommandHandler("start", start))
app.add_handler(MessageHandler(filters.TEXT & ~filters.COMMAND, handle_message))

print("Bot started...")
app.run_polling()
